Revit 2024 API
StructuralConnectionHandler.CreateGenericConnection Method
 Creates a new instance of a Structural Connection Handler with a generic type, which defines the connection between given elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static StructuralConnectionHandler CreateGenericConnection(
	Document document,
	IList<ElementId> idsToConnect
)
Visual Basic
Public Shared Function CreateGenericConnection ( _
	document As Document, _
	idsToConnect As IList(Of ElementId) _
) As StructuralConnectionHandler
Visual C++
public:
static StructuralConnectionHandler^ CreateGenericConnection(
	Document^ document,
	IList<ElementId^>^ idsToConnect
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The Revit document.
idsToConnect
Type: System.Collections.Generic.IList<ElementId>
 The list of element ids of connected elements.
Return Value
 The newly created generic connection.
Remarks
 Elements should be of the following structural categories: framings (OST_StructuralFraming), columns (OST_StructuralColumns), walls (OST_Walls), floors (OST_Floors) or foundations (OST_StructuralFoundations). The first of given elements is set as the primary one. A generic connection type will be created by default, if there is none present in the model.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  It verifies that we have at least one element id in the list.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace